ELPasEDT/src/Documents/ЗаписьЖурналаУчетаРеагентов/ЗаписьЖурналаУчетаРеагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаписьЖурналаУчетаРеагентов</name>
  <registerRecords>InformationRegister.РаботаХимцеха</registerRecords>
  <registerRecords>AccumulationRegister.ИспользованиеРеагентов</registerRecords>
  <registerRecords>AccumulationRegister.РеагентыВПодразделениях</registerRecords>
  <registerRecords>InformationRegister.УровеньРаствораВМернике</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>Оборудование</name>
    <type>
      <types>CatalogRef.Оборудование</types>
    </type>
  </attributes>
  <attributes>
    <name>ВахтаНачалаЗакачки</name>
    <type>
      <types>CatalogRef.Вахты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВахтаНачалаРасхода</name>
    <type>
      <types>CatalogRef.Вахты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВахтаОкончанияЗакачки</name>
    <type>
      <types>CatalogRef.Вахты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВахтаОкончанияРасхода</name>
    <type>
      <types>CatalogRef.Вахты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидРеагента</name>
    <type>
      <types>EnumRef.ВидыРеагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяЗакачки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяРасхода</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаЗакачки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаРасхода</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияЗакачки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияРасхода</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий1</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий2</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий3</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий4</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КонцентрацияНаНачалоЗакачки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>6</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонцентрацияНаНачалоРасхода</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>6</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонцентрацияНаОкончаниеЗакачки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>6</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонцентрацияНаОкончаниеРасхода</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>6</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонцентрацияПоДокументам</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбъемСработанногоРаствораЗакачка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>6</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбъемСработанногоРаствораРасход</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>6</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственныйНачалаЗакачки</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственныйНачалаРасхода</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственныйОкончанияЗакачки</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственныйОкончанияРасхода</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПлотностьПоТаблицам</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>6</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Расход</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>6</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РасходТоварногоРеагента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>6</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СменаНачалаЗакачки</name>
    <type>
      <types>CatalogRef.Смены</types>
    </type>
  </attributes>
  <attributes>
    <name>СменаНачалаРасхода</name>
    <type>
      <types>CatalogRef.Смены</types>
    </type>
  </attributes>
  <attributes>
    <name>СменаОкончанияЗакачки</name>
    <type>
      <types>CatalogRef.Смены</types>
    </type>
  </attributes>
  <attributes>
    <name>СменаОкончанияРасхода</name>
    <type>
      <types>CatalogRef.Смены</types>
    </type>
  </attributes>
  <attributes>
    <name>УровеньНаНачалоЗакачки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>6</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УровеньНаНачалоРасхода</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>6</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УровеньНаОкончаниеЗакачки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>6</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УровеньНаОкончаниеРасхода</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>6</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмеренияКоличества</name>
    <type>
      <types>CatalogRef.ЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмеренияКонцентрации</name>
    <type>
      <types>CatalogRef.ЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмеренияПлотности</name>
    <type>
      <types>CatalogRef.ЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>Партия</name>
    <type>
      <types>DocumentRef.ПриходРеагента</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидРасхода</name>
    <type>
      <types>CatalogRef.ВидыРасходаРеагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>НаправлениеРасхода</name>
    <type>
      <types>CatalogRef.НаправленияРасходаРеагентов</types>
      <types>CatalogRef.Оборудование</types>
    </type>
  </attributes>
  <attributes>
    <name>Реагент</name>
    <type>
      <types>CatalogRef.Реагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>РучнаяКорректировка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗакачкаНачата</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗакачкаЗавершена</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РасходНачат</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РасходЗавершен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаписьОтменена</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РассчитатьРасходВоВремяЗакачки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяЧистогоРасхода</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбъемЧистогоРасхода</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>6</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияЧистойЗакачки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияЧистогоРасхода</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>НеВключатьВЖурнал</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументПриемаСмены</name>
    <type>
      <types>DocumentRef.ОперативныйЖурнал</types>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийАвтрораИзменений</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Корректировки</name>
    <attributes>
      <name>Автор</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ELPasEDT/src/InformationRegisters/БазовыеЕдиницыИзмеренияРеагентов/БазовыеЕдиницыИзмеренияРеагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>БазовыеЕдиницыИзмеренияРеагентов</name>
  <resources>
    <name>ЕдиницаИзмеренияКоличества</name>
    <type>
      <types>CatalogRef.КлассификаторЕдиницИзмерения</types>
    </type>
  </resources>
  <resources>
    <name>ЕдиницаИзмеренияКонцентрации</name>
    <type>
      <types>CatalogRef.КлассификаторЕдиницИзмерения</types>
    </type>
  </resources>
  <resources>
    <name>ЕдиницаИзмеренияПлотности</name>
    <type>
      <types>CatalogRef.КлассификаторЕдиницИзмерения</types>
    </type>
  </resources>
  <resources>
    <name>БазоваяЕдиницаИзмеренияОбъема</name>
    <type>
      <types>CatalogRef.КлассификаторЕдиницИзмерения</types>
    </type>
  </resources>
  <dimensions>
    <name>ВидРеагента</name>
    <type>
      <types>EnumRef.ВидыРеагентов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ELPasEDT/src/InformationRegisters/НастройкиПараметровАРМУчетаРеагентов/НастройкиПараметровАРМУчетаРеагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НастройкиПараметровАРМУчетаРеагентов</name>
  <resources>
    <name>ЕдиницаИзмеренияКонцентрацииРаствора</name>
    <type>
      <types>CatalogRef.ЕдиницыИзмерения</types>
    </type>
  </resources>
  <resources>
    <name>ЕдиницаИзмеренияПлотностиРаствора</name>
    <type>
      <types>CatalogRef.ЕдиницыИзмерения</types>
    </type>
  </resources>
  <resources>
    <name>ВыполнятьКонтрольУровня</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Реагент</name>
    <type>
      <types>CatalogRef.Реагенты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ELPasEDT/src/Documents/ЗаписьЖурналаУчетаРеагентов/Forms/ФормаДокумента/Module.bsl
&НаСервере
Функция РассчитатьНаСервере()
	//Возврат Документы.ЗаписьЖурналаУчетаРеагентов.ЗаполнитьРасчетныеПоказателиСтрокиЖурнала(Объект);
	ДокОбъект = РеквизитФормыВЗначение("Объект");
	ДокОбъект.РассчитатьРасход();
	ЗначениеВРеквизитФормы(ДокОбъект, "Объект");
КонецФункции

&НаКлиенте
Процедура Рассчитать(Команда)
	//ПоказатьЗначение(, РассчитатьНаСервере());
	РассчитатьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Оповестить("ИзмененаЗаписьЖургала", Новый Структура("Подразделение, Ссылка", Объект.Подразделение, Объект.Ссылка));
КонецПроцедуры

&НаКлиенте
Процедура РасходЗавершенПриИзменении(Элемент)
	//Если Объект.РасходЗавершен Тогда
	//	Объект.РасходОтсечкаВремени = Ложь;
	//КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура РасходОтсечкаВремениПриИзменении(Элемент)
	Если Объект.РасходОтсечкаВремени Тогда
		Объект.РасходЗавершен = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
КонецПроцедуры

&НаСервере
Процедура РеагентПриИзмененииНаСервере()
	
	Объект.ВидРеагента = Объект.Реагент.ВидРеагента;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	БазовыеЕдиницыИзмеренияРеагентов.ЕдиницаИзмеренияКоличества КАК ЕдиницаИзмеренияКоличества,
	|	БазовыеЕдиницыИзмеренияРеагентов.ЕдиницаИзмеренияКонцентрации КАК ЕдиницаИзмеренияКонцентрации,
	|	БазовыеЕдиницыИзмеренияРеагентов.ЕдиницаИзмеренияПлотности КАК ЕдиницаИзмеренияПлотности
	|ПОМЕСТИТЬ ВТ_БазовыеЕИ
	|ИЗ
	|	РегистрСведений.БазовыеЕдиницыИзмеренияРеагентов КАК БазовыеЕдиницыИзмеренияРеагентов
	|ГДЕ
	|	БазовыеЕдиницыИзмеренияРеагентов.ВидРеагента = &ВидРеагента
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СпрЕдиницаИзмеренияКоличества.Ссылка КАК ЕдиницаИзмеренияКоличества,
	|	СпрЕдиницаИзмеренияКонцентрации.Ссылка КАК ЕдиницаИзмеренияКонцентрации,
	|	СпрЕдиницаИзмеренияПлотности.Ссылка КАК ЕдиницаИзмеренияПлотности
	|ИЗ
	|	ВТ_БазовыеЕИ КАК ВТ_БазовыеЕИ
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЕдиницыИзмерения КАК СпрЕдиницаИзмеренияКоличества
	|		ПО ВТ_БазовыеЕИ.ЕдиницаИзмеренияКоличества = СпрЕдиницаИзмеренияКоличества.БазоваяЕдиницаИзмерения
	|			И (СпрЕдиницаИзмеренияКоличества.Владелец = &Владелец)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЕдиницыИзмерения КАК СпрЕдиницаИзмеренияКонцентрации
	|		ПО ВТ_БазовыеЕИ.ЕдиницаИзмеренияКонцентрации = СпрЕдиницаИзмеренияКонцентрации.БазоваяЕдиницаИзмерения
	|			И (СпрЕдиницаИзмеренияКонцентрации.Владелец = &Владелец)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЕдиницыИзмерения КАК СпрЕдиницаИзмеренияПлотности
	|		ПО ВТ_БазовыеЕИ.ЕдиницаИзмеренияПлотности = СпрЕдиницаИзмеренияПлотности.БазоваяЕдиницаИзмерения
	|			И (СпрЕдиницаИзмеренияПлотности.Владелец = &Владелец)");
	Запрос.УстановитьПараметр("Владелец",    Объект.Реагент);
	Запрос.УстановитьПараметр("ВидРеагента", Объект.ВидРеагента);
	
КонецПроцедуры

&НаКлиенте
Процедура РеагентПриИзменении(Элемент)
	РеагентПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПартияПриИзменении(Элемент)
	
	ПартияПриИзмененииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПартияПриИзмененииНаСервере()
	
	Объект.ЕдиницаИзмеренияПлотности    = Объект.Партия.ЕдиницаИзмеренияПлотности;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	НастройкиПараметровАРМУчетаРеагентов.ЕдиницаИзмеренияКонцентрацииРаствора КАК ЕдиницаИзмеренияКонцентрацииРаствора,
	|	НастройкиПараметровАРМУчетаРеагентов.ЕдиницаИзмеренияПлотностиРаствора КАК ЕдиницаИзмеренияПлотностиРаствора,
	|	НастройкиПараметровАРМУчетаРеагентов.ВыполнятьКонтрольУровня КАК ВыполнятьКонтрольУровня
	|ИЗ
	|	РегистрСведений.НастройкиПараметровАРМУчетаРеагентов КАК НастройкиПараметровАРМУчетаРеагентов
	|ГДЕ
	|	НастройкиПараметровАРМУчетаРеагентов.Организация = &Организация
	|	И НастройкиПараметровАРМУчетаРеагентов.Реагент = &Реагент");
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	Запрос.УстановитьПараметр("Реагент", Объект.Реагент);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Объект.ЕдиницаИзмеренияКонцентрации = Выборка.ЕдиницаИзмеренияКонцентрацииРаствора;
		Объект.ЕдиницаИзмеренияПлотности    = Выборка.ЕдиницаИзмеренияПлотностиРаствора;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		РеагентПриИзмененииНаСервере();	
	Иначе
		
		Если Не РольДоступна("ПолныеПрава") И Не РольДоступна("ИнженерХВО") Тогда
			ТолькоПросмотр = Истина;
			
			Если Параметры.Свойство("ДокументПриемаСмены") 
				И Параметры.ДокументПриемаСмены = Объект.ДокументПриемаСмены Тогда
				
				ТолькоПросмотр = Ложь;
				ТекущийПользовательАвтор = Истина;
			КонецЕсли;
		КонецЕсли;
		
		Если ТолькоПросмотр Или Не ПравоДоступа("Изменение", Метаданные.Документы.ЗаписьЖурналаУчетаРеагентов) Тогда
			Элементы.ФормаРассчитать.Доступность = Ложь;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьКомментарийАвтрораИзменений()
	
	Комментарий = "";
	
	Если Объект.Комментарий1 <> Объект.Ссылка.Комментарий1 Тогда
		Если Не ПустаяСтрока(Комментарий) Тогда
			Комментарий = Комментарий + "
				|";
		КонецЕсли;
		Комментарий = Комментарий + СтрЗаменить(Объект.Комментарий1, Объект.Ссылка.Комментарий1, "");
	КонецЕсли;
	
	Если Объект.Комментарий2 <> Объект.Ссылка.Комментарий2 Тогда
		Если Не ПустаяСтрока(Комментарий) Тогда
			Комментарий = Комментарий + "
				|";
		КонецЕсли;
		Комментарий = Комментарий + СтрЗаменить(Объект.Комментарий2, Объект.Ссылка.Комментарий2, "");
	КонецЕсли;
	
	Если Объект.Комментарий3 <> Объект.Ссылка.Комментарий3 Тогда
		Если Не ПустаяСтрока(Комментарий) Тогда
			Комментарий = Комментарий + "
				|";
		КонецЕсли;
		Комментарий = Комментарий + СтрЗаменить(Объект.Комментарий3, Объект.Ссылка.Комментарий3, "");
	КонецЕсли;
	
	Если Объект.Комментарий4 <> Объект.Ссылка.Комментарий4 Тогда
		Если Не ПустаяСтрока(Комментарий) Тогда
			Комментарий = Комментарий + "
				|";
		КонецЕсли;
		Комментарий = Комментарий + СтрЗаменить(Объект.Комментарий4, Объект.Ссылка.Комментарий4, "");
	КонецЕсли;
	
	Возврат СокрЛП(Комментарий);
	
КонецФункции

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если Не ТекущийПользовательАвтор Тогда
	
		Комментарий = ПолучитьКомментарийАвтрораИзменений();
		
		Если Не ПустаяСтрока(Комментарий) Тогда
			
			Объект.РучнаяКорректировка = Истина;
			
			НовСтр = ТекущийОбъект.Корректировки.Добавить();
			НовСтр.Автор = ПользователиКлиентСервер.ТекущийПользователь();
			НовСтр.Дата = ТекущаяДата();
			НовСтр.Комментарий = Комментарий;
			
			ТекущийОбъект.КомментарийАвтрораИзменений = Комментарий;
			
		Иначе
			
			Если Не РольДоступна("ПолныеПрава") Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Необходимо указать причину корректировки",,,, Отказ);
			КонецЕсли;
			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
